<?/*

1)
Домен - название сайта (url).
Хостинг - Это место на сервере, где зранится наш сайт. Сайт - это файлы и БД.


2)
3 способа зарегистрировать домен:
		а) получение доамена вместе с хостингом.
									  Лучше им не пользоваться!!  - не понятно на кого зарегиструестя домен,
			                          -  что будет с доменом, если хостинг разорится, или мы захотим поменять хостинг.
		б) Корневые регистраторы, у них напрямую регистрируем (например reg.ru - №1 в росии, еще  r01.ru, webnames.ru) - обычно они дороже.
		в) Регистрация у партнеров (партнеры корневого решистратора, скупают оптом домены) (например 2domains.ru) - чуть дешеале, менее надежнее.





